---
kind: other
id: AllMembers.T:Autodesk.Revit.DB.MEPAnalyticalConnection
source: html/6a275390-3a07-ee2b-1459-c1bf92f704bf.htm
---
# MEPAnalyticalConnection Members

Returns true if the properties CreatedPhaseId and DemolishedPhaseId can be modified for this Element.